tutorials/Lagrangian/rhoTurbTwinParcelFoam/simplifiedSiwek/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Foam Application Class

// Start point of run
startFrom       latestTime;

// Calculation start time
startTime       0;

// End point of run
stopAt          endTime;

// Calculation end time
endTime         0.5;

// Calculation time step
deltaT          1.0e-4;

// Type of write output control
writeControl    adjustableRunTime;

// Interval with which the results are output
writeInterval   0.01;

// Limits number of time directories before overwriting
purgeWrite      0;

// Write Format
writeFormat     ascii;

// Significant figures of written ASCII data
writePrecision  10;

// Write Compression
writeCompression uncompressed;

// Time directories name format
timeFormat      general;

// Decimal precision of time directory names
timePrecision   6;

// Can parameters be modified during run time?
runTimeModifiable yes;

// Automatic adjustment of time step?
adjustTimeStep  yes;

// maxCo
maxCo           0.2;

// maxDeltaT
maxDeltaT       1;

// ************************************************************************* //
